In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("titanic.csv")

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
for index in df.index:
   if df.loc[index,'Survived']==0:
      df.loc[index,'Survived']='dead'
   else:
     df.loc[index,'Survived']='alive'

C:\Users\admin\AppData\Local\Temp\ipykernel_17056\1224001255.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'dead' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[index,'Survived']='dead'

In [5]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,dead,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,alive,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,alive,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,alive,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,dead,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,dead,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,alive,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,dead,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,alive,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,dead,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [9]:
def change_survived(a):
    if a == 0:
        return 'dead'
    else:
        return 'alive'

In [11]:
change_survived(0) #calling a function

'dead'

In [18]:
df.Survived = df.Survived.apply(change_survived)

In [17]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,alive,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,alive,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,alive,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,alive,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,alive,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,alive,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,alive,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,alive,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,alive,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,alive,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [19]:
s = lambda a:'alive' if a == 1 else 'dead'

In [20]:
df=pd.read_csv('titanic.csv')

In [21]:
;df.Survived = df.Survived.apply(s)

In [22]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,dead,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,alive,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,alive,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,alive,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,dead,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,dead,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,alive,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,dead,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,alive,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,dead,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [29]:
df.rename(columns={'Sex':'Male'},inplace=True)

In [30]:
df

,PassengerId,Survived,Pclass,Name,Male,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,dead,3,"Braund, Mr. Owen Harris",male,dead,1,0,A/5 21171,7.2500,NaN,S
1,2,alive,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,dead,1,0,PC 17599,71.2833,C85,C
2,3,alive,3,"Heikkinen, Miss. Laina",female,dead,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,alive,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,dead,1,0,113803,53.1000,C123,S
4,5,dead,3,"Allen, Mr. William Henry",male,dead,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,dead,2,"Montvila, Rev. Juozas",male,dead,0,0,211536,13.0000,NaN,S
887,888,alive,1,"Graham, Miss. Margaret Edith",female,dead,0,0,112053,30.0000,B42,S
888,889,dead,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,dead,1,2,W./C. 6607,23.4500,NaN,S
889,890,alive,1,"Behr, Mr. Karl Howell",male,dead,0,0,111369,30.0000,C148,C
890,891,dead,3,"Dooley, Mr. Patrick",male,dead,0,0,370376,7.7500,NaN,Q

In [32]:
lambda s: 1 if s =='male' else 'female'

In [34]:
df.Male=df.Male.apply(lambda s: 1 if s =='male' else 0)

In [36]:
df

,PassengerId,Survived,Pclass,Name,Male,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,dead,3,"Braund, Mr. Owen Harris",1,dead,1,0,A/5 21171,7.2500,NaN,S
1,2,alive,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,dead,1,0,PC 17599,71.2833,C85,C
2,3,alive,3,"Heikkinen, Miss. Laina",0,dead,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,alive,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,dead,1,0,113803,53.1000,C123,S
4,5,dead,3,"Allen, Mr. William Henry",1,dead,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,dead,2,"Montvila, Rev. Juozas",1,dead,0,0,211536,13.0000,NaN,S
887,888,alive,1,"Graham, Miss. Margaret Edith",0,dead,0,0,112053,30.0000,B42,S
888,889,dead,3,"Johnston, Miss. Catherine Helen ""Carrie""",0,dead,1,2,W./C. 6607,23.4500,NaN,S
889,890,alive,1,"Behr, Mr. Karl Howell",1,dead,0,0,111369,30.0000,C148,C
890,891,dead,3,"Dooley, Mr. Patrick",1,dead,0,0,370376,7.7500,NaN,Q

In [38]:
df=pd.read_csv("titanic.csv")

In [40]:
df.Age=df.Age.apply(lambda a: 60 if a>= 60 else a)

In [41]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [44]:
(df.Age>60).sum()

np.int64(0)

In [1]:
#prepex  for link